app/views/movies/show.html.erb

SELECT  1 AS one FROM "reviews"  WHERE "reviews"."movie_id" = ? LIMIT 1  [["movie_id", 1]]
---

  <% if @movie.reviews.any? %>