app/controllers/reviews_controller.rb

	 def edit
    @review = @movie.reviews.find(params[:id])
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 3]]

  def update
    @review = @movie.reviews.find(params[:id])
    if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 3]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = 3  [["comment", "It's been years since a movie superhero was this fierce and this funny!!"], ["updated_at", "2016-01-22 00:43:39.454824"]]

	def destroy
	@review = @movie.reviews.find(params[:id])
    @review.destroy
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 6]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 6]]